
#Область ПрограммныйИнтерфейс

Функция ИмяСервераСеанса() Экспорт
    
    Перем ИмяКомпьютера;
    
    ПараметрыКлиентаНаСервере = ПараметрыСеанса.md_ПараметрыКлиентаНаСервере;
    
    Если ТипЗнч(ПараметрыКлиентаНаСервере) = Тип("ФиксированноеСоответствие") Тогда
        
        ИмяКомпьютера = ПараметрыКлиентаНаСервере.Получить("ИмяКомпьютера");
                
    КонецЕсли; 
        
    Возврат ?(ЗначениеЗаполнено(ИмяКомпьютера), ИмяКомпьютера, "");
		
КонецФункции

Функция УниверсальноеВремяНаСервере() Экспорт
    
    Возврат md_ВерсионированиеElasticsearchВызовСервера.УниверсальноеВремяНаСервере();
    
КонецФункции

#КонецОбласти