
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПредставлениеОтправленияСтрока = ТекущийОбъект.СообщениеОтправки.Получить();
	
	Если ТипЗнч(ПредставлениеОтправленияСтрока) = Тип("Строка") Тогда
		
		ПредставлениеОтправления = ПредставлениеОтправленияСтрока;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.ТолькоПросмотр = Истина;
	
КонецПроцедуры

#КонецОбласти
