
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
   	
   	Перем ПараметрыВерсионирования;
   	
    ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
    ОтчетМетаданные = ОтчетОбъект.Метаданные();
    
    КлючОбъекта = ОтчетМетаданные.ПолноеИмя();
    НаименованиеОтчета = СокрЛП(ОтчетМетаданные.Представление());
    
    Параметры.Свойство("ДокументСсылка", ВерсионируемыйОбъект);
    Параметры.Свойство("ПараметрыВерсионирования", ПараметрыВерсионирования);
    
    Если ЗначениеЗаполнено(ПараметрыВерсионирования) Тогда
    	
    	ПараметрыВерсионирования.Свойство("ДатаОтбора", ДатаОтбора);
    	ПараметрыВерсионирования.Свойство("ИндексES", ИндексES);
    	ПараметрыВерсионирования.Свойство("СерверES", СерверES);
    	ПараметрыВерсионирования.Свойство("ВсегоВерсий", ВсегоВерсий);	
    	
    	Элементы.ВсегоВерсийДекорация.Заголовок = md_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	    "Всего версий объекта: %1", ВсегоВерсий);
    
    КонецЕсли;
    
    СводныеДанныеПоВерсиямПолучены = Ложь;
    
КонецПроцедуры

&НаСервере
Процедура УстановитьПользовательскиеНастройкиИзПараметров()
    
    КоллекцияНастроек = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
    
    УстановитьЗначениеПользовательскогоПараметраПоУмолчанию(КоллекцияНастроек, "СсылкаНаОбъект", 
    ВерсионируемыйОбъект);
	УстановитьЗначениеПользовательскогоПараметраПоУмолчанию(КоллекцияНастроек, "ДатаОтбора", ДатаОтбора);
	УстановитьЗначениеПользовательскогоПараметраПоУмолчанию(КоллекцияНастроек, "ИндексES", ИндексES);
	УстановитьЗначениеПользовательскогоПараметраПоУмолчанию(КоллекцияНастроек, "СерверES", СерверES);
	УстановитьЗначениеПользовательскогоПараметраПоУмолчанию(КоллекцияНастроек, "КоличествоВерсий", ВсегоВерсий);
	
	СводныеДанныеПоВерсиямПолучены = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    
    УстановитьОбработчикиСобытийПользовательскихНастроек();
    
    Если НЕ СводныеДанныеПоВерсиямПолучены Тогда
        
        ПолучитьКоличествоВерсийОбъекта();
        
    КонецЕсли; 
    
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СсылкаНаОбъект_ПриИзменении(Элемент)
    
    ПолучитьКоличествоВерсийОбъекта();
    КоллекцияНастроек = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
    УстановитьЗначениеПользовательскогоПараметраПоУмолчанию(КоллекцияНастроек, "КоличествоВерсий", ВсегоВерсий);
    
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
    
    СуффиксФормыИсточника = ИсточникВыбора.ИмяФормы;
    ПозицияТочки = СтрДлина(СуффиксФормыИсточника);
    Пока Сред(СуффиксФормыИсточника, ПозицияТочки, 1) <> "." Цикл
        ПозицияТочки = ПозицияТочки - 1;
    КонецЦикла;
    СуффиксФормыИсточника = ВРег(Сред(СуффиксФормыИсточника, ПозицияТочки + 1));
    
    Если СуффиксФормыИсточника = ВРег("ФормаВариантаОтчета")
        ИЛИ СуффиксФормыИсточника = ВРег("ФормаВарианта") Тогда
        ИзмененияИзФормыВариантаОтчета = Истина;
    КонецЕсли;
    
    Если ИзмененияИзФормыВариантаОтчета <> Неопределено Тогда
        
        ЗагрузитьСхемуИОчиститьФорму(ВыбранноеЗначение);
        
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСхемуИОчиститьФорму(НовыеНастройки)
    
    Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НовыеНастройки.Настройки);
    Отчет.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(НовыеНастройки.ПользовательскиеНастройки);
    
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки, ИспользуютсяСтандартныеНастройки)
	
	Если ЗначениеЗаполнено(ВерсионируемыйОбъект) Тогда
		
		ИспользуютсяСтандартныеНастройки = Ложь;
		УстановитьПользовательскиеНастройкиИзПараметров();
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
    
    СкомпоноватьРезультат(РежимКомпоновкиРезультата.Фоновый);
    
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПолучитьКоличествоВерсийОбъекта()
    
    ПолучитьВерсионируемыйОбъектКонтроля();
    
    ПолучитьПараметрыИнстансаElasticsearch(
    Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы);
    
    ЗаполнитьСводныеДанныеОбъекта();
    
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗначениеПользовательскогоПараметраПоУмолчанию(КоллекцияНастроек, ИмяПараметра, Значение)
    
    Для Каждого ПользовательскаяНастройка Из КоллекцияНастроек Цикл
        
        Если ТипЗнч(ПользовательскаяНастройка) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных")  
            И ПользовательскаяНастройка.Параметр = Новый ПараметрКомпоновкиДанных(ИмяПараметра) Тогда
            
            ПользовательскаяНастройка.Значение = Значение;
            ПользовательскаяНастройка.Использование = Истина;
            
        КонецЕсли;
        
    КонецЦикла;  
    
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСводныеДанныеОбъекта()
    
    ВсегоВерсий = 0;
    
    Если ЗначениеЗаполнено(ВерсионируемыйОбъект) И ЗначениеЗаполнено(СерверES) 
        И ЗначениеЗаполнено(ИндексES) Тогда
        
        СводныеДанные = ПолучитьСводныеДанныеОбъектаНаСервере();	
        СводныеДанные.Свойство("ВсегоВерсий", ВсегоВерсий);  
        
    КонецЕсли; 
    
    Элементы.ВсегоВерсийДекорация.Заголовок = md_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
    "Всего версий объекта: %1", ВсегоВерсий);
    
КонецПроцедуры

&НаСервере
Функция ПолучитьСводныеДанныеОбъектаНаСервере()
    
    Возврат md_ВерсионированиеElasticsearchСлужебный.ПолучитьСводныеДанныеОбъекта(
    СерверES,
    ИндексES, 
    ВерсионируемыйОбъект);
    
КонецФункции

&НаКлиенте
Процедура ПолучитьЗначениеПараметра(ИмяРевизитаФормы, ИмяПараметра, КоллекцияЭлементовНастроек)
    
    Для Каждого ПользовательскаяНастройка Из КоллекцияЭлементовНастроек Цикл
        
        Если ТипЗнч(ПользовательскаяНастройка) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных")  
            И ПользовательскаяНастройка.Параметр = Новый ПараметрКомпоновкиДанных(ИмяПараметра) Тогда
            
            ЭтотОбъект[ИмяРевизитаФормы] = ПользовательскаяНастройка.Значение;
            
        КонецЕсли;
        
    КонецЦикла; 
    
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВерсионируемыйОбъектКонтроля()
    
    ПолучитьЗначениеПараметра("ВерсионируемыйОбъект", "СсылкаНаОбъект",
    Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы);
    
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПараметрыИнстансаElasticsearch(КоллекцияНастроек)
    
    ПолучитьЗначениеПараметра("СерверElasticsearch", "СерверElasticsearch", КоллекцияНастроек);
    
    ПолучитьЗначениеПараметра("ИндексES", "ИндексES", КоллекцияНастроек);
    
КонецПроцедуры 

&НаСервере
Процедура УстановитьОбработчикиСобытийПользовательскихНастроек()
    
    Для Каждого ЭлементФормы Из ЭтотОбъект.Элементы Цикл
        
        Если ТипЗнч(ЭлементФормы) = Тип("ГруппаФормы") И ЭлементФормы.Заголовок = "Ссылка на объект" Тогда
            
            Если НЕ ЭлементФормы.ПодчиненныеЭлементы.Количество() = 0 Тогда
                
                Для Каждого ПодчиненныйЭлемент Из ЭлементФормы.ПодчиненныеЭлементы Цикл
                    
                    Если ТипЗнч(ПодчиненныйЭлемент) = Тип("ПолеФормы") Тогда
                        
                        ПодчиненныйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_СсылкаНаОбъект_ПриИзменении")
                        
                    КонецЕсли; 
                    
                КонецЦикла; 
                
            КонецЕсли;
            
        КонецЕсли; 
        
    КонецЦикла; 
    
КонецПроцедуры


#КонецОбласти 


