
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем ТекстЗаголовка;
	
	Если Параметры.Свойство("ТекстЗаголовка", ТекстЗаголовка) И ЗначениеЗаполнено(ТекстЗаголовка) Тогда
			
		Элементы.ДекорацияТекст.Заголовок = ТекстЗаголовка;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	НачалоОжидания = ТекущаяДата();
	
	ПодключитьОбработчикОжидания("ОбработчикОжидания", 1, Ложь);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработчикОжидания()
	
	ВремяОперации = ТекущаяДата() - НачалоОжидания;
	
КонецПроцедуры

#КонецОбласти
