
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	//ШаблонТекста = Новый ФорматированнаяСтрока(
	//"База данных: %1
	//|Файл архива: %2
	//|Каталог БД:  %3");	
	//	
	//Элементы.ДекорацияТекст.Заголовок = СтрШаблон(ШаблонТекста, 
	//	Параметры.ИмяБазыДанных,
	//	Параметры.ФайлАрхива,
	//	Параметры.КаталогБазы
	//);
	//	
	//adoCommand = РаботаСSQLКлиент.НачатьВосстановлениеБазы(Параметры.СтрокаСоединения, 
	//	Параметры.ИмяБазыДанных, 
	//	Параметры.ФайлАрхива, 
	//	Параметры.КаталогБазы,
	//	//Makarevich+
	//	?(Параметры.Обезличивать,1,0));
	//	//Makarevich-

	//Если adoCommand = Неопределено Тогда	
	//	Возврат;
	//КонецЕсли;
	//	
	//ПодключитьОбработчикОжидания("ОбработчикОжидания", 1, Ложь);
	//
	//НачалоОжидания = ТекущаяДата();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработчикОжидания()
	
	//ВремяОперации = ТекущаяДата() - НачалоОжидания;
	//
	//Если РаботаСSQLКлиент.ПроверитьЗавершениеКоманды(adoCommand) Тогда
	//	
	//	ОтключитьОбработчикОжидания("ОбработчикОжидания");
	//	РаботаСSQLКлиент.ЗакрытьСодинениеКоманды(adoCommand);
	//	ЭтотОбъект.Закрыть();
	//	
	//КонецЕсли;

КонецПроцедуры	

#КонецОбласти
