////////////////////////////////////////////////////////////////////////////////
// Модуль менеджера регистра сведений "md_ОчередьДанныхКОтправкеВElasticsearch"
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ДобавитьУдалитьЗаписьИзРегистра(СтруктураЗаписиРегистра, Удаление = Ложь) Экспорт
	
	НабораЗаписейРегистра = РегистрыСведений.md_ОчередьДанныхКОтправкеВElasticsearch.СоздатьНаборЗаписей();
	НабораЗаписейРегистра.Отбор.ДатаРегистрации.Установить(СтруктураЗаписиРегистра.ДатаРегистрации);
	НабораЗаписейРегистра.Отбор.СерверElasticsearch.Установить(СтруктураЗаписиРегистра.СерверElasticsearch);
	НабораЗаписейРегистра.Отбор.ИндексES.Установить(СтруктураЗаписиРегистра.ИндексES);
	НабораЗаписейРегистра.Отбор.СсылкаНаОбъект.Установить(СтруктураЗаписиРегистра.СсылкаНаОбъект);
	
	Если НЕ Удаление Тогда
		
		ЗаписьНабора = НабораЗаписейРегистра.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьНабора, СтруктураЗаписиРегистра); 
			
	КонецЕсли; 
	
	НабораЗаписейРегистра.Записать();
	
КонецПроцедуры
 
#КонецОбласти

