#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ИмяВНрег = НРег(Имя);
	
	Если НЕ ИмяВНрег = Имя Тогда
	
		Информирование = НСтр("ru='Имя индекса должно быть задано в нижнем регистре.'");
		md_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Информирование, Отказ);	
		
	КонецЕсли;
	
	Если НЕ ВИмениТолькоЦифрыИБуквыЛатинскогоАлфавита(Имя) Тогда
		
		Информирование = НСтр("ru='В имени индекса допустимы только символы латиницы, цифр и ""_""'");
		md_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Информирование, , , , Отказ);
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВИмениТолькоЦифрыИБуквыЛатинскогоАлфавита(Знач Имя) 
	
	Если НЕ ЗначениеЗаполнено(Имя) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	ИмяСоотвествуетТребованиям = Истина;
	ДлинаИмени = СтрДлина(Имя);
	
	Для ПНомер = 1 По ДлинаИмени Цикл
		
		AКод = КодСимвола(Имя, ПНомер);
		СимволСоотвествуетТребованиям = md_ОбщегоНазначенияКлиентСервер.ЭтоБукваЛатинскогоАлфавитаИлиЦифра(AКод); 
		Если НЕ СимволСоотвествуетТребованиям Тогда
			
			ИмяСоотвествуетТребованиям = Ложь;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;	

	Возврат ИмяСоотвествуетТребованиям;
	
КонецФункции

#КонецОбласти


