
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УникальныйИдентификаторСтрокой = Строка(Запись.УникальныйИдентификатор);
	ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    
    УстановитьВидимостьТекстаBulkЗапроса();
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийШапкиФормы

&НаКлиенте
Процедура ПоказатьТекстЗапросаДляBulkApiПриИзменении(Элемент)
    
    УстановитьВидимостьТекстаBulkЗапроса();
    
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьЗапрос(Команда)
	
	ИмяКоманды = Команда.Имя;
	ОбработатьКомандуОтображения(ИмяКоманды);

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтвет(Команда)
	
	ИмяКоманды = Команда.Имя;
	ОбработатьКомандуОтображения(ИмяКоманды);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуОтображения(ИмяКоманды)
    
    ШаблонЗаголовкаЗапроса = "%1(%2)";
    
	Если ИмяКоманды = "ПоказатьЗапрос" Тогда	
        
        ИзвлечьТекстЗапроса();
        
        ЗаголовокЗапроса =md_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗаголовкаЗапроса,
        НСтр("ru = 'Запрос'; en = 'Request'"), РазмерСтрокой(СтрДлина(ТекстЗапроса)));  
        
		Элементы.Запрос.Видимость = Истина;
        Элементы.Запрос.Заголовок = ЗаголовокЗапроса;
        Элементы.Страницы.ТекущаяСтраница = Элементы.Запрос;
		Элементы.ПоказатьЗапрос.Доступность = Ложь;
        
	ИначеЕсли  ИмяКоманды = "ПоказатьОтвет" Тогда 
        
        ИзвлечьТекстОтвета();
        
        ЗаголовокЗапроса =md_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗаголовкаЗапроса,
        НСтр("ru = 'Ответ'; en = 'Response'"), РазмерСтрокой(СтрДлина(ТекстЗапроса)));
        
		Элементы.Ответ.Видимость = Истина;
        Элементы.Ответ.Заголовок = ЗаголовокЗапроса;
		Элементы.Страницы.ТекущаяСтраница = Элементы.Ответ;
		Элементы.ПоказатьОтвет.Доступность = Ложь;
        
	КонецЕсли; 
		
КонецПроцедуры 
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьТекстаBulkЗапроса()
    
    Элементы.ТекстЗапросаВСтроке.Видимость = ПоказатьТекстЗапросаДляBulkApi;
    
    Если ПоказатьТекстЗапросаДляBulkApi Тогда
        
        ТекстЗапросаВСтроке = ПолучитьТекстВСтроке(ТекстЗапроса);	
        
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ИзвлечьТекстЗапроса()
	
    Объект = РеквизитФормыВЗначение("Запись");
    ТекстЗапросаХранилище = Объект.ХранилищеЗапроса.Получить();
    
    Если ЗначениеЗаполнено(ТекстЗапросаХранилище) Тогда	
        
        ТекстЗапроса = ПолучитьОтформатированныйТекст(ТекстЗапросаХранилище);
        
        Если ПоказатьТекстЗапросаДляBulkApi Тогда
            
            ТекстЗапросаВСтроке = ПолучитьТекстВСтроке(ТекстЗапросаХранилище);	
            
        КонецЕсли;    
        
    КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзвлечьТекстОтвета()
	
	Объект = РеквизитФормыВЗначение("Запись");
	ТекстОтветаХранилище = Объект.ХранилищеОтвета.Получить();
    
    Если ЗначениеЗаполнено(ТекстОтветаХранилище) Тогда	
        
        ТекстОтвета = ПолучитьОтформатированныйТекст(ТекстОтветаХранилище);
        
    КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РазмерСтрокой(Размер)
    
    Порог10Килобайт = 10240;
    Порог10Мегабайт = 10485760; // 10*1024*1024
    Порог10Гигабайт = 10737418240; // 10*1024*1024*1024
    
    ДелительКб = 1024;
    ДелительМб = 1048576; // 1024*1024
    ДелительГб = 1073741824; // 1024*1024*1024 
    
    ШаблонРазмера = "%1%2";
    ПредставлениеРазмераСтрокой = Строка(Размер); 
    
    Если Размер >= Порог10Килобайт Тогда
        
        ПредставлениеРазмераСтрокой = md_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонРазмера, 
        Цел(Размер / ДелительКб), "К");
		        
    ИначеЕсли Размер >= Порог10Мегабайт Тогда
        
        ПредставлениеРазмераСтрокой = md_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонРазмера, 
        Цел(Размер / ДелительМб), "M");
        
    ИначеЕсли Размер >= Порог10Гигабайт Тогда
        
        ПредставлениеРазмераСтрокой = md_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонРазмера, 
        Цел(Размер / ДелительГб), "G");
        
	КонецЕсли;
	
	Возврат ПредставлениеРазмераСтрокой;
    
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОтформатированныйТекст(ИсходныйТекст)
	
	Возврат ИсходныйТекст;
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьТекстВСтроке(ИсходныйТекст)
    
    Возврат md_ВерсионированиеElasticsearchВызовСервера.ПреобразоватьСообщениеВстроку(ИсходныйТекст);
    
КонецФункции 

#КонецОбласти



