////////////////////////////////////////////////////////////////////////////////
// Интеграция elasticsearch (Клиент)
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Если ТолстыйКлиентОбычноеПриложение Тогда    
    
Процедура ДополнитьФормуКомандойПросмотраВерсий(Форма) Экспорт
        
    ЕстьВозможностьСравненияВерсий = Пользователи.РолиДоступны("гкс_ЗапускОтчетаСравнениеВерсийElasticsearch");
    
    Если ЕстьВозможностьСравненияВерсий Тогда
        
        КнопкаКоманды = Форма.ЭлементыФормы.ДействияФормы.Кнопки.Найти("СравнитьВерсииДокумента");    
        
        Если КнопкаКоманды = Неопределено Тогда
            
            Форма.ЭлементыФормы.ДействияФормы.Кнопки.Добавить(Неопределено, ТипКнопкиКоманднойПанели.Разделитель);
            
            КнопкаКоманды = Форма.ЭлементыФормы.ДействияФормы.Кнопки.Добавить("СравнитьВерсииДокумента", 
            ТипКнопкиКоманднойПанели.Действие, "Сравнить версии документа", 
            Новый Действие("ДействияФормыСравнитьВерсииДокумента"));
            
            КнопкаКоманды.Отображение = ОтображениеКнопкиКоманднойПанели.Надпись;
            
            Форма.ЭлементыФормы.ДействияФормы.Кнопки.Добавить(Неопределено, ТипКнопкиКоманднойПанели.Разделитель);
            
        КонецЕсли;
        
    КонецЕсли;     
                
КонецПроцедуры 

// Открывает и формирует отчет сравнения версий "md_СравнениеВерсийElasticsearch"
//  
// Параметры:
//  ИмяОбъектаМетаданных - Строка - Строковое имя объекта метаданных.
//  ДокументСсылка - ДокументСсылка - Ссылка на любой документ (тип должен входить в 
//  определеяемый тип "md_ОбъектыВерсионированияElasticSearch"
//
Процедура СравнитьВерсииДокумента(ИмяОбъектаМетаданных, ДокументСсылка) Экспорт
    
    ШаблонВариантаОтчетаПоУмолчанию = "СравнениеВерсийДокумента%1";
    
    ИмяОбъектаВарианта = md_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонВариантаОтчетаПоУмолчанию,
    ИмяОбъектаМетаданных);
    
    ВариантОтчетаПоУмолчанию = гкс_ОбщегоНазначенияКлиентСервер.ПроизвольныйПредопределенныйОбъект(ИмяОбъектаВарианта);
    
    ПараметрыОткрытия = Новый Структура;
    
    ПараметрыОткрытия.Вставить("ДокументСсылка", ДокументСсылка);
    ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
    ПараметрыОткрытия.Вставить("ВариантОтчетаПоУмолчанию", ВариантОтчетаПоУмолчанию);
    
    ОткрытьФорму("Отчет.md_СравнениеВерсийElasticsearch.Форма.ФормаОтчета", ПараметрыОткрытия, 
    , Новый УникальныйИдентификатор);
    
КонецПроцедуры 
 
#КонецЕсли 

#КонецОбласти

