////////////////////////////////////////////////////////////////////////////////
// Интеграция elasticsearch (Клиент)
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Открывает и формирует отчет сравнения версий "md_СравнениеВерсийElasticsearch"
//  
// Параметры:
//  ИмяОбъектаМетаданных - Строка - Строковое имя объекта метаданных.
//  ДокументСсылка - ДокументСсылка - Ссылка на любой документ (тип должен входить в 
//  определеяемый тип "md_ОбъектыВерсионированияElasticSearch"
//
Процедура СравнитьВерсииДокумента(Форма, Объект, ИмяКоманды) Экспорт
    
    ПараметрыФормы = Новый Структура;
    
    ХранилищеПараметровПодключения = Форма.ПараметрыПодключенияКElasticsearch;
    
    ПараметрыПодключения = 
    md_ВерсионированиеElasticsearchВызовСервера.ПолучитьПараметрыИзХранилища(Объект,
    ХранилищеПараметровПодключения, 
    ИмяКоманды);
    
    ПараметрыФормы.Вставить("ДанныеНастроек", ПараметрыПодключения);
    ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
    
    ОткрытьФорму("Отчет.md_СравнениеВерсийElasticsearch.Форма", ПараметрыФормы);
    
КонецПроцедуры 
 
#КонецОбласти

