#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	md_ВерсионированиеElasticsearch.ФормаПриСозданииНаСервере(ЭтотОбъект, Отказ);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_СравнитьВерсии(Команда)
	
	ИмяКоманды = Команда.Имя;
	
	ОбъектСравнения = Элементы.Список.ТекущаяСтрока;
	
	md_ВерсионированиеElasticsearchКлиент.СравнитьВерсииДокумента(ЭтотОбъект, ОбъектСравнения, ИмяКоманды);
	
	
КонецПроцедуры

#КонецОбласти

